app/Controllers/AuthController.php

    public function login()
    {
        $userModel = new UserModel();

        $email    = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'utku@gmail.com'
 LIMIT 1