app/Controllers/HomeController.php

SELECT *
FROM `categories`
SELECT *
FROM `products`
WHERE `category_id` = '3'
SELECT *
FROM `categories`
WHERE `categories`.`id` = '3'
SELECT *
FROM `products`
SELECT `favorites`.`id` as `fav_id`, `favorites`.`product_id`
FROM `favorites`
WHERE `user_id` = '1'
---
    public function index($categoryId = null)
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        // Tüm kategoriler
        $data['categories'] = $categoryModel->findAll();

        if ($categoryId) {
            // Seçili kategoriye ait ürünleri getir
            $data['products'] = $productModel->where('category_id', $categoryId)->findAll();

            // Geçerli kategori var mı diye kontrol edelim (opsiyonel)
            $currentCategory = $categoryModel->find($categoryId);
            if (!$currentCategory) {
                throw PageNotFoundException::forPageNotFound("Kategori bulunamadı!");
            }
            $data['currentCategory'] = $currentCategory['name'];
        } else {
            // Kategori seçilmemişse tüm ürünleri getir
            $data['products'] = $productModel->findAll();
            $data['currentCategory'] = null;
        }

        $data['userFavorites'] = [];
        if (session()->get('logged_in')) {
            $userId = session()->get('user_id');
            $favoriteModel = new \App\Models\FavoriteModel();
            // Bu kullanıcının TÜM favorilerini çekelim (product_id -> favorites.id eşlemesi de lazım)
            $favs = $favoriteModel
                ->select('favorites.id as fav_id, favorites.product_id')
                ->where('user_id', $userId)
                ->findAll();